tests/mock-data/orders/orders-update.json

{
  "id": 585466511383,
  "email": "arobbins@simpleblend.nettttttt",
  "closed_at": null,
  "created_at": "2018-08-13 20:46:19",
  "updated_at": "2018-08-13 20:46:20",
  "number": 62,
  "note": null,
  "token": "cd5db862af0011981aa2f7ec69a98d5d",
  "gateway": null,
  "total_price": 0,
  "subtotal_price": 0,
  "total_weight": 548,
  "total_tax": "0.00",
  "taxes_included": 0,
  "currency": "USD",
  "financial_status": "paid",
  "confirmed": 1,
  "total_discounts": "6.89",
  "total_line_items_price": 0,
  "cart_token": "",
  "buyer_accepts_marketing": 0,
  "name": "#1062",
  "referring_site": "http://wpstest.test/",
  "landing_site": "/api/graphql",
  "cancelled_at": null,
  "cancel_reason": null,
  "total_price_usd": 0,
  "checkout_token": "4461d0c7a4d58bce18502504076cfd0c",
  "reference": null,
  "user_id": null,
  "location_id": null,
  "source_identifier": null,
  "source_url": null,
  "processed_at": "2018-08-13 20:46:19",
  "device_id": null,
  "phone": null,
  "customer_locale": "en",
  "app_id": 2489557,
  "browser_ip": null,
  "landing_site_ref": null,
  "order_number": 1062,
  "discount_codes": [{
    "code": "SPRING30",
    "amount": "30.00",
    "type": "fixed_amount"
  }],
  "note_attributes": "",
  "payment_gateway_names": "",
  "processing_method": "free",
  "checkout_id": 3722600382487,
  "source_name": "2489557",
  "fulfillment_status": null,
  "tax_lines": "",
  "tags": "",
  "contact_email": "arobbins@simpleblend.net",
  "order_status_url": "https://wpslitetest10.myshopify.com/24007681/orders/cd5db862af0011981aa2f7ec69a98d5d/authenticate?key=51c75e3d4abff8803d3adf7a5607063e",
  "line_items": [{
    "fulfillable_quantity": 1,
    "fulfillment_service": "amazon",
    "fulfillment_status": "fulfilled",
    "grams": 500,
    "id": 669751112,
    "price": "199.99",
    "product_id": 7513594,
    "quantity": 1,
    "requires_shipping": true,
    "sku": "IPOD-342-N",
    "title": "IPod Nano",
    "variant_id": 4264112,
    "variant_title": "Pink",
    "vendor": "Apple",
    "name": "IPod Nano - Pink",
    "gift_card": false,
    "properties": [
      {
        "name": "custom engraving",
        "value": "Happy Birthday Mom!"
      }
    ],
    "taxable": true,
    "tax_lines": [
      {
        "title": "State Tax",
        "price": "3.98",
        "rate": 0.06
      }
    ],
    "total_discount": "5.00",
    "discount_allocations": [
      {
        "amount": "5.00",
        "discount_application_index": 2
      }
    ]
  }],
  "shipping_lines": [
    {
      "code": "Free Shipping",
      "price": "0.00",
      "source": "shopify",
      "title": "Free Shipping",
      "tax_lines": [
        {
          "title": "State Tax",
          "price": "3.98",
          "rate": 0.06
        }
      ],
      "carrier_identifier": "third_party_carrier_identifier",
      "requested_fulfillment_service_id": "third_party_fulfillment_service_id"
    }
  ],
  "billing_address": {
    "first_name": "Bob",
    "address1": "Chestnut Street 92",
    "phone": "555-625-1199",
    "city": "Louisville",
    "zip": "40202",
    "province": "Kentucky",
    "country": "United States",
    "last_name": "Norman",
    "address2": "",
    "company": null,
    "latitude": 45.41634,
    "longitude": -75.6868,
    "name": "Bob Norman",
    "country_code": "US",
    "province_code": "KY"
  },
  "shipping_address": {
    "first_name": "Bob",
    "address1": "Chestnut Street 92",
    "phone": "555-625-1199",
    "city": "Louisville",
    "zip": "40202",
    "province": "Kentucky",
    "country": "United States",
    "last_name": "Norman",
    "address2": "",
    "company": null,
    "latitude": 45.41634,
    "longitude": -75.6868,
    "name": "Bob Norman",
    "country_code": "US",
    "province_code": "KY"
  },
  "fulfillments": "",
  "client_details": {
    "browser_ip": "0.0.0.0",
    "accept_language": null,
    "user_agent": null,
    "session_hash": null,
    "browser_width": null,
    "browser_height": null
  },
  "refunds": "",
  "customer": {
    "id": 311604871191,
    "email": "arobbins@simpleblend.net",
    "accepts_marketing": false,
    "created_at": "2018-01-22T11:35:38-06:00",
    "updated_at": "2018-08-13T15:46:20-05:00",
    "first_name": "Andrew",
    "last_name": "Robbins",
    "orders_count": 10,
    "state": "disabled",
    "total_spent": "0.00",
    "last_order_id": 585466511383,
    "note": "sdfsdf sdf sdf",
    "verified_email": true,
    "multipass_identifier": null,
    "tax_exempt": false,
    "phone": null,
    "tags": "",
    "last_order_name": "#1062",
    "addresses": [
      {
        "id": 297724968983,
        "customer_id": 311604871191,
        "first_name": "sdfdf",
        "last_name": "sdfsdf",
        "company": null,
        "address1": "1214 West Lake Street",
        "address2": "",
        "city": "Minneapolis",
        "province": "Minnesota",
        "country": "United States",
        "zip": "55408",
        "phone": null,
        "name": "sdfdf sdfsdf",
        "province_code": "MN",
        "country_code": "US",
        "country_name": "United States",
        "default": false
      },
      {
        "id": 298064969751,
        "customer_id": 311604871191,
        "first_name": "Andrew",
        "last_name": "Robbins",
        "company": null,
        "address1": "614 N 1st St",
        "address2": "#606",
        "city": "Minneapolis",
        "province": "Minnesota",
        "country": "United States",
        "zip": "55401",
        "phone": null,
        "name": "Andrew Robbins",
        "province_code": "MN",
        "country_code": "US",
        "country_name": "United States",
        "default": false
      },
      {
        "id": 299941691415,
        "customer_id": 311604871191,
        "first_name": "Andrew",
        "last_name": "Robbins",
        "company": null,
        "address1": "614 North 1st Street",
        "address2": "606",
        "city": "Minneapolis",
        "province": "Minnesota",
        "country": "United States",
        "zip": "55401",
        "phone": null,
        "name": "Andrew Robbins",
        "province_code": "MN",
        "country_code": "US",
        "country_name": "United States",
        "default": false
      },
      {
        "id": 745870786583,
        "customer_id": 311604871191,
        "first_name": "skdfslkdfj",
        "last_name": "skfdlksdjflsdkf",
        "company": null,
        "address1": "123 West Lake Street",
        "address2": "",
        "city": "Minneapolis",
        "province": "Minnesota",
        "country": "United States",
        "zip": "55408",
        "phone": null,
        "name": "skdfslkdfj skfdlksdjflsdkf",
        "province_code": "MN",
        "country_code": "US",
        "country_name": "United States",
        "default": false
      },
      {
        "id": 776285749271,
        "customer_id": 311604871191,
        "first_name": "Andrew",
        "last_name": "Robbins",
        "company": null,
        "address1": "611 West Lake Street",
        "address2": "",
        "city": "Minneapolis",
        "province": "Minnesota",
        "country": "United States",
        "zip": "55408",
        "phone": null,
        "name": "Andrew Robbins",
        "province_code": "MN",
        "country_code": "US",
        "country_name": "United States",
        "default": false
      },
      {
        "id": 776301412375,
        "customer_id": 311604871191,
        "first_name": "Andrew",
        "last_name": "Robbins",
        "company": null,
        "address1": "7717 Nicollet Avenue",
        "address2": "",
        "city": "Minneapolis",
        "province": "Minnesota",
        "country": "United States",
        "zip": "55423",
        "phone": null,
        "name": "Andrew Robbins",
        "province_code": "MN",
        "country_code": "US",
        "country_name": "United States",
        "default": false
      },
      {
        "id": 776365080599,
        "customer_id": 311604871191,
        "first_name": "Andrew",
        "last_name": "Robbins",
        "company": null,
        "address1": "1221 West Lake Street",
        "address2": "",
        "city": "Minneapolis",
        "province": "Minnesota",
        "country": "United States",
        "zip": "55408",
        "phone": null,
        "name": "Andrew Robbins",
        "province_code": "MN",
        "country_code": "US",
        "country_name": "United States",
        "default": false
      },
      {
        "id": 783808266263,
        "customer_id": 311604871191,
        "first_name": "Andrew",
        "last_name": "Robbins",
        "company": null,
        "address1": "123 West Lake Street",
        "address2": "",
        "city": "Minneapolis",
        "province": "Minnesota",
        "country": "United States",
        "zip": "55408",
        "phone": null,
        "name": "Andrew Robbins",
        "province_code": "MN",
        "country_code": "US",
        "country_name": "United States",
        "default": true
      }
    ],
    "admin_graphql_api_id": "gid://shopify/Customer/311604871191",
    "default_address": {
      "id": 783808266263,
      "customer_id": 311604871191,
      "first_name": "Andrew",
      "last_name": "Robbins",
      "company": null,
      "address1": "123 West Lake Street",
      "address2": "",
      "city": "Minneapolis",
      "province": "Minnesota",
      "country": "United States",
      "zip": "55408",
      "phone": null,
      "name": "Andrew Robbins",
      "province_code": "MN",
      "country_code": "US",
      "country_name": "United States",
      "default": true
    }
  }
}
